testhound/alo/alo/octave/m480/M480BranchInsnVisitor.cpp
  void M480BranchInsnVisitor::visit(const M480JtableRelativebrInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getDst();

    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JHec5Instruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand())
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JaddlInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }
  
  void M480BranchInsnVisitor::visit(const M480JaddliInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JaddwhInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JaddwhiInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JaddwlInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JaddwliInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JaddwwInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JaddwwiInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JsublInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JsubliInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JsubwhInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JsubwhiInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JsubwlInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JsubwliInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JsubwwInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JsubwwiInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }

  void M480BranchInsnVisitor::visit(const M480JbcdiInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getSrc1();
    if(!opnd->isNullOperand()) 
      {
	shared_ptr<const LlirOperand> rpc = i.getDst();
	
	if(rpc->isNullOperand())
	  { 
	    //no RPC hence a branch...
	   opnd->accept(v);
	  }
      }
  }

  void M480BranchInsnVisitor::visit(const M480JbcdrInstruction &i)
  {}

  void M480BranchInsnVisitor::visit(const M480JbciInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getSrc1();

    if(!opnd->isNullOperand()) 
      {
	shared_ptr<const LlirOperand> rpc = i.getDst();
	
	if(rpc->isNullOperand())
	  { 
	    //no RPC hence a branch...
	   opnd->accept(v);
	  }
      }
  }

  void M480BranchInsnVisitor::visit(const M480JbcrInstruction &i)
  {}

  void M480BranchInsnVisitor::visit(const M480JrnmiInstruction &i)
  {}

  void M480BranchInsnVisitor::visit(const M480JrintInstruction &i)
  {}

  void M480BranchInsnVisitor::visit(const M480JbiInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getSrc1();
    if(!opnd->isNullOperand()) 
      {
	shared_ptr<const LlirOperand> rpc = i.getDst();
	
	if(rpc->isNullOperand())
	  { 
	    //no RPC hence a branch...
	    opnd->accept(v);
	  }
      }
  }
  
  void M480BranchInsnVisitor::visit(const M480JbnzrInstruction &i)
  {}

  void M480BranchInsnVisitor::visit(const M480JbnziInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getSrc2();
    if(!opnd->isNullOperand()) 
      {
	shared_ptr<const LlirOperand> rpc = i.getCmpReg();
	
	if(rpc->isNullOperand())
	  { 
	    //no RPC hence a branch...
	    opnd->accept(v);
	  }
      }
  }

  void M480BranchInsnVisitor::visit(const M480JbrInstruction &i)
  {}

  void M480BranchInsnVisitor::visit(const M480JbrsInstruction &i)
  {}

  void M480BranchInsnVisitor::visit(const M480JbrslInstruction &i)
  {}

  void M480BranchInsnVisitor::visit(const M480JbzrInstruction &i)
  {}

  void M480BranchInsnVisitor::visit(const M480JbziInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getSrc2();
    if(!opnd->isNullOperand()) 
      {
	shared_ptr<const LlirOperand> rpc = i.getCmpReg();

	if(rpc->isNullOperand())
	  { 
	    //no RPC hence a branch...
	    opnd->accept(v);
	  }
      }
  }

  void M480BranchInsnVisitor::visit(const M480JcmpInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }
  
  void M480BranchInsnVisitor::visit(const M480JcmpiInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getBranchTarget();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }
  
  void M480BranchInsnVisitor::visit(const M480JtsetbInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getDisp();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }
  
  void M480BranchInsnVisitor::visit(const M480JtclrbInstruction &i)
  {
    BranchIsJumpVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getDisp();
    if(!opnd->isNullOperand()) 
      opnd->accept(v);
  }



  //////////////////////////
  // Call Insn Visitor
  //////////////////////////

  M480CallInsnVisitor::M480CallInsnVisitor(OctaveAlo &i, 			  
					   shared_ptr<AltEntryFunction> fn)
    : OctaveBranchInsnVisitor(i),
      m_currentFn(fn)
  {}

  M480CallInsnVisitor::M480CallInsnVisitor(const M480CallInsnVisitor& rhs)
    : OctaveBranchInsnVisitor(rhs)
  {}

