testhound/alo/alo/octave/m480/M480BranchInsnVisitor.cpp
  void M480CallInsnVisitor::visit(const M480JHec5Instruction &)
  {}

  void M480CallInsnVisitor::visit(const M480JaddlInstruction &i)
  {}
  
  void M480CallInsnVisitor::visit(const M480JaddliInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JaddwhInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JaddwhiInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JaddwlInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JaddwliInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JaddwwInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JaddwwiInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JsublInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JsubliInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JsubwhInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JsubwhiInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JsubwlInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JsubwliInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JsubwwInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JsubwwiInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JbcdiInstruction &i)
  {
    BranchIsCallVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getSrc1();
    if(!opnd->isNullOperand()) 
      {
	shared_ptr<const LlirOperand> rpc = i.getDst();
	
	if(!rpc->isNullOperand())
	  { 
	    //RPC present, hence a call..
	   opnd->accept(v);
	  }
      }

  }

  void M480CallInsnVisitor::visit(const M480JbcdrInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JbciInstruction &i)
  {
    BranchIsCallVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getSrc1();

    if(!opnd->isNullOperand()) 
      {
	shared_ptr<const LlirOperand> rpc = i.getDst();
	
	if(!rpc->isNullOperand())
	  { 
	    //RPC present, hence a call..
	   opnd->accept(v);
	  }
      }
  }

  void M480CallInsnVisitor::visit(const M480JbcrInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JrnmiInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JrintInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JbiInstruction &i)
  {
    BranchIsCallVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getSrc1();

    if(!opnd->isNullOperand()) 
      {
	shared_ptr<const LlirOperand> rpc = i.getDst();
	
	if(!rpc->isNullOperand())
	  { 
	    //RPC present, hence a call..
	   opnd->accept(v);
	  }
      }
  }
  
  void M480CallInsnVisitor::visit(const M480JbnzrInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JbnziInstruction &i)
  {
    BranchIsCallVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getSrc2();


    if(!opnd->isNullOperand()) 
      {
	shared_ptr<const LlirOperand> rpc = i.getCmpReg();
	
	if(!rpc->isNullOperand())
	  { 
	    //RPC present, hence a call..
	    opnd->accept(v);
	  }
      }
  }

  void M480CallInsnVisitor::visit(const M480JbrInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JbrsInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JbrslInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JbzrInstruction &i)
  {}

  void M480CallInsnVisitor::visit(const M480JbziInstruction &i)
  {
    BranchIsCallVisitor v(getCurrentFn());
    shared_ptr<const LlirOperand> opnd = i.getSrc2();

    if(!opnd->isNullOperand()) 
      {
	shared_ptr<const LlirOperand> rpc = i.getCmpReg();
	
	if(!rpc->isNullOperand())
	  { 
	    //RPC present, hence a call..
	    opnd->accept(v);
	  }
      }
  }

  void M480CallInsnVisitor::visit(const M480JcmpInstruction &i)
  {}
  
  void M480CallInsnVisitor::visit(const M480JcmpiInstruction &i)
  {}
  
  void M480CallInsnVisitor::visit(const M480JtsetbInstruction &i)
  {}
  
  void M480CallInsnVisitor::visit(const M480JtclrbInstruction &i)
  {}


  ///////////////////////////////////////////////



}
